podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/CT32B1_LPC13Uxx.svd.xml
<!--
Devices using this peripheral: 
      LPC13Uxx
-->
      <peripheral>
         <?sourceFile "CT32B1_LPC13Uxx" ?>
         <name>CT32B1</name>
         <description>32-bit counter/timers CT32B1</description>
         <groupName>CT32B</groupName>
         <headerStructName>CT32B1</headerStructName>
         <baseAddress>0x40018000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x34</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x3C</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x70</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>IR</name>
               <description>Interrupt Register. The IR can be written to clear interrupts. The IR can be read to identify which of eight possible interrupt sources are pending</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>MR0INT</name>
                     <description>Interrupt flag for match channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MR1INT</name>
                     <description>Interrupt flag for match channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MR2INT</name>
                     <description>Interrupt flag for match channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MR3INT</name>
                     <description>Interrupt flag for match channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR0INT</name>
                     <description>Interrupt flag for capture channel 0 event</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR1INT</name>
                     <description>Interrupt flag for capture channel 1 event</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCR</name>
               <description>Timer Control Register. The TCR is used to control the Timer Counter functions. The Timer Counter can be disabled or reset through the TCR</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>CEN</name>
                     <description>Counter enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THE_COUNTERS_ARE_DIS</name>
                           <description>The counters are disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THE_TIMER_COUNTER_AN</name>
                           <description>The Timer Counter and Prescale Counter are enabled for counting</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRST</name>
                     <description>Counter reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DO_NOTHING_</name>
                           <description>Do nothing</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THE_TIMER_COUNTER_AN</name>
                           <description>The Timer Counter and the Prescale Counter are synchronously reset on the next positive edge of PCLK. The counters remain reset until TCR[1] is returned to zero</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC</name>
               <description>Timer Counter. The 32-bit TC is incremented every PR+1 cycles of PCLK. The TC is controlled through the TCR</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>TC</name>
                     <description>Timer counter value</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PR</name>
               <description>Prescale Register. When the Prescale Counter (below) is equal to this value, the next clock increments the TC and clears the PC</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>PCVAL</name>
                     <description>Prescaler value</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PC</name>
               <description>Prescale Counter. The 32-bit PC is a counter which is incremented to the value stored in PR. When the value in PR is reached, the TC is incremented and the PC is cleared. The PC is observable and controllable through the bus interface</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>PC</name>
                     <description>Prescale counter value</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCR</name>
               <description>Match Control Register. The MCR is used to control if an interrupt is generated and if the TC is reset when a Match occurs</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>MR0I</name>
                     <description>Interrupt on MR0: an interrupt is generated when MR0 matches the value in the TC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="MR0I" > <name>MR0R</name> <description>Reset on MR0: the TC will be reset if MR0 matches it</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="MR0I" > <name>MR0S</name> <description>Stop on MR0: the TC and PC will be stopped and TCR[0] will be set to 0 if MR0 matches the TC</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="MR0I" > <name>MR1I</name> <description>Interrupt on MR1: an interrupt is generated when MR1 matches the value in the TC</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="MR0I" > <name>MR1R</name> <description>Reset on MR1: the TC will be reset if MR1 matches it</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="MR0I" > <name>MR1S</name> <description>Stop on MR1: the TC and PC will be stopped and TCR[0] will be set to 0 if MR1 matches the TC</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="MR0I" > <name>MR2I</name> <description>Interrupt on MR2: an interrupt is generated when MR2 matches the value in the TC</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="MR0I" > <name>MR2R</name> <description>Reset on MR2: the TC will be reset if MR2 matches it</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="MR0I" > <name>MR2S</name> <description>Stop on MR2: the TC and PC will be stopped and TCR[0] will be set to 0 if MR2 matches the TC</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="MR0I" > <name>MR3I</name> <description>Interrupt on MR3: an interrupt is generated when MR3 matches the value in the TC</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="MR0I" > <name>MR3R</name> <description>Reset on MR3: the TC will be reset if MR3 matches it</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="MR0I" > <name>MR3S</name> <description>Stop on MR3: the TC and PC will be stopped and TCR[0] will be set to 0 if MR3 matches the TC</description> <bitOffset>11</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>MR0</name>
               <description>Match Register 0. MR0 can be enabled through the MCR to reset the TC, stop both the TC and PC, and/or generate an interrupt every time MR0 matches the TC</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>MATCH</name>
                     <description>Timer counter match value</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
